--
-- PostgreSQL database dump
--

-- Dumped from database version 17.4
-- Dumped by pg_dump version 17.4

-- Started on 2025-03-12 21:59:52

SET statement_timeout = 0;
SET lock_timeout = 0;
SET idle_in_transaction_session_timeout = 0;
SET transaction_timeout = 0;
SET client_encoding = 'UTF8';
SET standard_conforming_strings = on;
SELECT pg_catalog.set_config('search_path', '', false);
SET check_function_bodies = false;
SET xmloption = content;
SET client_min_messages = warning;
SET row_security = off;

SET default_tablespace = '';

SET default_table_access_method = heap;

--
-- TOC entry 221 (class 1259 OID 16416)
-- Name: Databases; Type: TABLE; Schema: public; Owner: postgres
--

CREATE TABLE public."Databases" (
    post_id integer NOT NULL,
    post_keywords text,
    post_text text,
    post_url text NOT NULL
);


ALTER TABLE public."Databases" OWNER TO postgres;

--
-- TOC entry 220 (class 1259 OID 16409)
-- Name: LinuxWindowsAD; Type: TABLE; Schema: public; Owner: postgres
--

CREATE TABLE public."LinuxWindowsAD" (
    post_id integer NOT NULL,
    post_keywords text,
    post_text text,
    post_url text NOT NULL
);


ALTER TABLE public."LinuxWindowsAD" OWNER TO postgres;

--
-- TOC entry 218 (class 1259 OID 16395)
-- Name: Network; Type: TABLE; Schema: public; Owner: postgres
--

CREATE TABLE public."Network" (
    post_id integer NOT NULL,
    post_keywords text,
    post_text text,
    post_url text NOT NULL
);


ALTER TABLE public."Network" OWNER TO postgres;

--
-- TOC entry 225 (class 1259 OID 16444)
-- Name: OSINTphishing; Type: TABLE; Schema: public; Owner: postgres
--

CREATE TABLE public."OSINTphishing" (
    post_id integer NOT NULL,
    post_keywords text,
    post_text text,
    post_url text NOT NULL
);


ALTER TABLE public."OSINTphishing" OWNER TO postgres;

--
-- TOC entry 219 (class 1259 OID 16402)
-- Name: PentestSoftware; Type: TABLE; Schema: public; Owner: postgres
--

CREATE TABLE public."PentestSoftware" (
    post_id integer NOT NULL,
    post_keywords text,
    post_text text,
    post_url text NOT NULL
);


ALTER TABLE public."PentestSoftware" OWNER TO postgres;

--
-- TOC entry 217 (class 1259 OID 16388)
-- Name: Programming; Type: TABLE; Schema: public; Owner: postgres
--

CREATE TABLE public."Programming" (
    post_id integer NOT NULL,
    post_keywords text,
    post_text text,
    post_url text NOT NULL
);


ALTER TABLE public."Programming" OWNER TO postgres;

--
-- TOC entry 222 (class 1259 OID 16423)
-- Name: ReversMalwaredev; Type: TABLE; Schema: public; Owner: postgres
--

CREATE TABLE public."ReversMalwaredev" (
    post_id integer NOT NULL,
    post_keywords text,
    post_text text,
    post_url text NOT NULL
);


ALTER TABLE public."ReversMalwaredev" OWNER TO postgres;

--
-- TOC entry 224 (class 1259 OID 16437)
-- Name: ServerDocker; Type: TABLE; Schema: public; Owner: postgres
--

CREATE TABLE public."ServerDocker" (
    post_id integer NOT NULL,
    post_keywords text,
    post_text text,
    post_url text NOT NULL
);


ALTER TABLE public."ServerDocker" OWNER TO postgres;

--
-- TOC entry 223 (class 1259 OID 16430)
-- Name: SteganographyCryptography; Type: TABLE; Schema: public; Owner: postgres
--

CREATE TABLE public."SteganographyCryptography" (
    post_id integer NOT NULL,
    post_keywords text,
    post_text text,
    post_url text NOT NULL
);


ALTER TABLE public."SteganographyCryptography" OWNER TO postgres;

--
-- TOC entry 4940 (class 0 OID 16416)
-- Dependencies: 221
-- Data for Name: Databases; Type: TABLE DATA; Schema: public; Owner: postgres
--

INSERT INTO public."Databases" VALUES (8, 'sql nosql books', 'SQL and NoSQL Interview Questions: Your essential guide to acing SQL and NoSQL job interviews (2023)
Авто: Vishwanathan Narayanan
Количество страниц: 178

Данная книга призвана познакомить вас с типами вопросов, с которыми вы можете столкнуться на собеседовании, а также дать рекомендации по подготовке и выработке соответствующей стратегии. В книге подробно рассматривается семейство NoSQL и SQL, начиная с фундаментальных основ и заканчивая такими продвинутыми темами, как архитектура, оптимизация и практические примеры использования. Она также включает подборку часто задаваемых вопросов с точки зрения запросов. Кроме того, эта книга призвана помочь вам при внесении изменений в последние минуты. В книге также рассматривается распространенная проблема собеседования - эффективное изложение сложных концепций в ясной и краткой форме, даже если вы хорошо разбираетесь в предмете.', 'https://t.me/infSecIT/27/266') ON CONFLICT DO NOTHING;
INSERT INTO public."Databases" VALUES (7, 'tools', 'fake2db v1.0.0

Генератор фейковых баз данных написанный на 🐍 Python. Поддерживает - sqlite, mysql, postgresql, mongodb, redis, couchdb

Установка:
pip install fake2db

Примеры:
fake2db --rows 200 --db sqlite
fake2db --rows 1500 --db postgresql --name test_database_postgre
fake2db --rows 200 --db sqlite --locale cs_CZ --seed 1337', 'https://t.me/infSecIT/27/94') ON CONFLICT DO NOTHING;
INSERT INTO public."Databases" VALUES (6, 'postgresql books', 'PostgreSQL for Jobseekers: Introduction to PostgreSQL administration for modern DBAs (2023)
Автор: David Gonzalez 
Количество страниц: 314


Книга охватывает широкий спектр тем, позволяя успешно устанавливать и настраивать PostgreSQL на различных платформах и различными способами. Углубленное изучение внутренних компонентов, составляющих службу PostgreSQL, и их взаимодействия позволит вам получить глубокое понимание того, как эти элементы взаимодействуют между собой для создания надежного и безопасного решения. От понимания модели процессов и общей памяти до освоения выполнения и оптимизации запросов - вы получите исчерпывающие знания о внутреннем устройстве PostgreSQL. Кроме того, в книге рассматриваются основные задачи, решаемые администратором баз данных (DBA), включая операции резервного копирования и восстановления, меры безопасности, настройку производительности и методы устранения неполадок.', 'https://t.me/infSecIT/27/93') ON CONFLICT DO NOTHING;
INSERT INTO public."Databases" VALUES (5, 'mongodb nosql books', 'MongoDB for Jobseekers: Reach new heights in your career with MongoDB (2023)
Автор: Justin Jenkins
Количество страниц: 430

Эта книга предлагает хорошо структурированный подход к пониманию тонкостей этой мощной базы данных NoSQL, начиная с основ и заканчивая продвинутыми концепциями. В книге рассматриваются такие темы, как моделирование схем, формирование запросов, индексирование и масштабируемость, а также раскрываются причины широкой популярности MongoDB. Благодаря наглядным практическим примерам книга поможет быстро освоить фундаментальные концепции и методики, необходимые для работы с MongoDB в реальных условиях.', 'https://t.me/infSecIT/27/92') ON CONFLICT DO NOTHING;
INSERT INTO public."Databases" VALUES (4, 'mysql books', 'Learning MySQL

Авторы: Vinicius M. Grippa, S. Kuzmichev
Год издания: 2021', 'https://t.me/infSecIT/27/91') ON CONFLICT DO NOTHING;
INSERT INTO public."Databases" VALUES (3, 'postgresql books', 'Learn PostgreSQL From Basics 

Автор: Silas Burch
Год издания: 2023', 'https://t.me/infSecIT/27/90') ON CONFLICT DO NOTHING;
INSERT INTO public."Databases" VALUES (2, 'source', 'database zip', 'https://t.me/infSecIT/27/89') ON CONFLICT DO NOTHING;
INSERT INTO public."Databases" VALUES (1, 'sql nosql books', 'SQL and NoSQL Databases: Modeling, Languages, Security and Architectures for Big Data Management, 2nd Edition
 
Автор: Andreas Meier, 2023

Описание: Данный учебник предлагает комплексное введение в реляционные (SQL) и нереляционные (NoSQL) базы данных. Авторы подробно рассматривают современное состояние средств и методов работы с базами данных и анализируют грядущие новинки. Авторы подробно анализируют управление, моделирование, языки, безопасность и архитектуру реляционных баз данных, графовых баз данных и баз данных документов. Кроме того, представлен обзор других подходов к базам данных на основе SQL и NoSQL.', 'https://t.me/infSecIT/27/88') ON CONFLICT DO NOTHING;


--
-- TOC entry 4939 (class 0 OID 16409)
-- Dependencies: 220
-- Data for Name: LinuxWindowsAD; Type: TABLE DATA; Schema: public; Owner: postgres
--

INSERT INTO public."LinuxWindowsAD" VALUES (20, 'powershell', 'Изучите PowerShell за месяц.

• Дата выхода: 2022 год.

Изучите PowerShell за месяц : охватывает Windows, Linux и macOS - это ориентированное на конкретные задачи руководство по администрированию систем Linux и macOS с использованием Microsoft PowerShell. Это инновационное руководство, предназначенное для занятых ИТ-специалистов, проведет вас от основ до профессионального владения PowerShell с помощью 25 учебных пособий', 'https://t.me/infSecIT/4/331') ON CONFLICT DO NOTHING;
INSERT INTO public."LinuxWindowsAD" VALUES (19, 'tools windows', 'Инструмент пост эксплуатации 💻Windows хостов для определения модифицируемых служб и ACL файлов

Установка:
git clone https://github.com/t3l3machus/ACEshark

cd ACEshark  
pip3 install -r requirements.txt 

Зависимости:
sudo apt-get install xclip
sudo apt-get install xselect

Запуск:
python3 ./ACEshark.py -s 10.10.1.10 -i

# Полученный скрипт выполняем на удаляемом хосте', 'https://t.me/infSecIT/4/328') ON CONFLICT DO NOTHING;
INSERT INTO public."LinuxWindowsAD" VALUES (18, 'windows source', 'Advanced Windows Persistence', 'https://t.me/infSecIT/4/327') ON CONFLICT DO NOTHING;
INSERT INTO public."LinuxWindowsAD" VALUES (17, 'ad windows tools', 'Rubeus — это набор инструментов, написанный на C#, для взаимодействия с Kerberos (основной протокол аутентификации в среде Windows Active Directory) и различных атак на него. 

С его помощью можно совершать следующие действия:
⏺️Запросы и продление билетов
⏺️Злоупотреблять делегированием
⏺️Подделывать билеты
⏺️Управлять билетами
⏺️Извлекать и собирать билеты
⏺️Получать учетные данные через Roasting

Рассмотрим некоторые возможности Rubeus:
1️⃣ Проведение атаки AS-REP Roasting — получаем AS-REP сообщение от имени пользователя, у которого установлен флаг “Не требовать предварительной аутентификации Kerberos”
Rubeus.exe asreproast /nowrap
2️⃣ Kerberoasting — получение TGS билета учетной записи, имеющей SPN.
Rubeus.exe kerberoast /nowrap
3️⃣ Silver ticket — возможность сгенерировать TGS билет на имя любого пользователя с указанием любых разрешений, если у атакующего есть пароль учетной записи службы или его NTLM хеш. 
Rubeus.exe silver /user:user /service:HTTP/Domain.Local /rc4:5a1caa1361243172e25d437573c67b28 /ldap /groups: 518,519,512,520,513 -user-id 1601 /nowrap /ptt
 4️⃣ Pass The Key — имея хеш пароля пользователя можем получить его TGT билет. Для этого сначала вычисляем RC4, AES128 или AES256 ключ, зная учетные данные пользователя. Затем запрашиваем сам билет.
Rubeus.exe hash /domain:Domain.Local /user:user1 /password:qwerty123! 

Rubeus.exe asktgt /user:s.user1 /rc4:5a1caa1361243172e25d437573c67b28 /nowrap

Для использования утилиты необходимо скачать исходный код по ссылке. (https://github.com/GhostPack/Rubeus/releases/tag/1.6.4) Затем собрать её, например в Visual Studio, предварительно отключив Defender, либо добавить каталог с проектом в исключения антивируса.', 'https://t.me/infSecIT/4/314') ON CONFLICT DO NOTHING;
INSERT INTO public."LinuxWindowsAD" VALUES (16, 'ad windows source', 'Прорываемся к домен контроллеру через розетку.

•  Занимательная история про внутренний пентест, в ходе которого специалистам удалось добраться до администратора домена не имея учетной записи.

•  В этом проекте использовались много разнообразных техник: от декомпиляции приложения и расшифровки извлеченных учетных данных, до повышения привилегий через базу данных на сервере и сбора информации от имени учетной записи компьютера. В рассказе подробно разобрано, как они сложились в успешный вектор атаки.', 'https://t.me/infSecIT/4/313') ON CONFLICT DO NOTHING;
INSERT INTO public."LinuxWindowsAD" VALUES (15, 'windows source', 'Exploit-Street (https://github.com/MzHmO/Exploit-Street#) — полный список эксплойтов LPE для Windows (начиная с 2023 года).', 'https://t.me/infSecIT/4/312') ON CONFLICT DO NOTHING;
INSERT INTO public."LinuxWindowsAD" VALUES (14, 'windows source', 'Kerberoasting.

•  Finding Kerberoastable Users Using setspn;
• (https://juggernaut-sec.com/kerberoasting/#Finding_Kerberoastable_Users_Using_setspn)  Rubeus.exe;
- (https://juggernaut-sec.com/kerberoasting/#Rubeusexe) Cracking the TGS-REP Hashes with Hashcat;
• (https://juggernaut-sec.com/kerberoasting/#Cracking_the_TGS-REP_Hashes_with_Hashcat)  Invoke-Kerberoast.ps1;
• (https://juggernaut-sec.com/kerberoasting/#Invoke-Kerberoastps1)  GetUserSPNs.py;
• (https://juggernaut-sec.com/kerberoasting/#GetUserSPNspy)  Mitigation;
• (https://juggernaut-sec.com/kerberoasting/#Mitigation)  Want to stay up to date with the latest hacks?

In (https://juggernaut-sec.com/kerberoasting/#Want_to_stay_up_to_date_with_the_latest_hacks) this blog post we will have a look at three different ways to perform kerberoasting, how to use hashcat to crack the service ticket (hash), and a few ways that we can mitigate this type of attack.', 'https://t.me/infSecIT/4/311') ON CONFLICT DO NOTHING;
INSERT INTO public."LinuxWindowsAD" VALUES (13, 'tools windows', 'Создаем кейлоггер для Windows.

•  Во Франции есть ИБ компания Synacktiv, (https://www.synacktiv.com/index) которая занимается пентестом и разработкой необходимых инструментов для их деятельности. В их блоге я заметил интересную и актуальную статью, где описан процесс написания кейлоггера (https://t.me/Social_engineering/1827) для Windows, способного поддерживать все раскладки клавиатуры и правильно реконструировать символы Юникода независимо от языка. Материал разделен на 3 части и вот его содержимое:

 - В первой (https://www.synacktiv.com/publications/writing-a-decent-win32-keylogger-13) части, авторы описывают три различных способа захвата нажатий клавиш (GetKeyState, SetWindowsHookEx, GetRawInputData ) и различия между этими методами.

 - Во второй (https://www.synacktiv.com/publications/writing-a-decent-win32-keylogger-23) части подробно описан процесс, как Windows хранит информацию о раскладках клавиатуры в файле kbd*.dll и как ее анализировать.

 - В третьей (https://www.synacktiv.com/publications/writing-a-decent-win32-keylogger-33) и заключительной части разложен процесс использования извлеченной информации для преобразования скан-кодов в символы и все сложные случаи, представленные различными раскладками, такими как лигатуры, мертвые клавиши, дополнительные состояния сдвига и SGCAPS.', 'https://t.me/infSecIT/4/310') ON CONFLICT DO NOTHING;
INSERT INTO public."LinuxWindowsAD" VALUES (12, 'commands linux', 'А в этом руководстве ты найдешь самые важные команды  Unix-подобных ОС. Для твоего удобства, команды сгруппированы по назначению.', 'https://t.me/infSecIT/4/271') ON CONFLICT DO NOTHING;
INSERT INTO public."LinuxWindowsAD" VALUES (11, 'tools linux', 'Клонирование виртуальных машин KVM

Для клонирования ВМ можно использовать простую команду virt-clone. Это утилита командной строки для клонирования существующих образов виртуальных машин с использованием библиотеки "libvirt". Она скопирует образы дисков любой существующей ВМ и определит нового гостя с идентичной конфигурацией виртуального оборудования. Элементы, которые требуют уникальности, будут обновлены, чтобы избежать столкновения между старыми и новыми ВМ.', 'https://t.me/infSecIT/4/270') ON CONFLICT DO NOTHING;
INSERT INTO public."LinuxWindowsAD" VALUES (10, 'source linux', 'Это руководство включает в себя полезные советы для повышения безопасности и конфиденциальности в ОС на базе ядра Linux.', 'https://t.me/infSecIT/4/269') ON CONFLICT DO NOTHING;
INSERT INTO public."LinuxWindowsAD" VALUES (9, 'commands linux', 'Как заставить пользователя изменить пароль при следующем входе в систему

Существует несколько способов:

Использование команды passwd
sudo passwd --expire [username]

Использование команды chage
sudo chage --lastday 0 [username]

Срок действия паролей
chage -l
Будет выведена следующая информация:
Когда пароль был последний раз изменен;
Дата окончания действия пароля;
Сколько дней осталось до окончания действия пароля;
Когда учетная запись пользователя будет закончена;
Минимальное кол-во дней между итерацией смены пароля;
Максимальное кол-во дней между итерацией смены пароля.

Заставляем пользователя менять пароль каждые 90 дней
sudo chage -M 90

Задаем срок жизни учетной записи (до 12 июня 2023)
sudo chage -E 2023-06-12 serg
sudo chage -E 2023-06-12 oleg

Сколько времени на смену пароля?
В примере даем Борису 10 дней на смену пароля с момента как пароль заэкспайрился
sudo chage -I 10 boris

Уведомление о смене пароля заранее
Через 25 дней истекает срок годности пароля Бориса
sudo chage -W 25 boris

Защищаемся от частой смены паролей пользователя
Минимальное количество дней между сменой паролей
sudo chage -m 25 boris

Удалить ограничение в днях
sudo chage -m 0 sergey', 'https://t.me/infSecIT/4/268') ON CONFLICT DO NOTHING;
INSERT INTO public."LinuxWindowsAD" VALUES (8, 'commands linux', 'Команда curl (синтаксис и примеры использования) 

Сurl – утилита командной строки для скачивания и загрузки данных. Она выросла из проекта шведского программиста Даниэля Стенберга. Изначально в середине 90-х, на заре развития Интернета, он разрабатывал бота, который должен был загружать с веб-страницы курсы валют и сообщать пользователям IRC эквивалент шведских крон в долларах США. 

Со временем проект развивался, появлялась поддержка различных протоколов и новые функции. Теперь curl используется для передачи любых данных и ряда других полезных задач. Рассмотрим основные моменты работы с этим инструментом.', 'https://t.me/infSecIT/4/267') ON CONFLICT DO NOTHING;
INSERT INTO public."LinuxWindowsAD" VALUES (7, 'source linux', 'CMD: изменение кодировок консоли', 'https://t.me/infSecIT/4/116') ON CONFLICT DO NOTHING;
INSERT INTO public."LinuxWindowsAD" VALUES (6, 'source linux', 'Перечисление и удаление правил брандмауэра Iptables

Iptables — это брандмауэр, который играет важную роль в обеспечении сетевой безопасности большинства систем Linux. Хотя многие руководства по работе с Iptables научат вас создавать правила брандмауэра для обеспечения безопасности вашего сервера, в этом руководстве мы будем уделять особое внимание другому аспекту управления брандмауэром: вывод списка и удаление правил.', 'https://t.me/infSecIT/4/115') ON CONFLICT DO NOTHING;
INSERT INTO public."LinuxWindowsAD" VALUES (5, 'source linux', 'stepik курс', 'https://t.me/infSecIT/4/114') ON CONFLICT DO NOTHING;
INSERT INTO public."LinuxWindowsAD" VALUES (4, 'source linux', 'Терминал Linux. Основы работы в командной строке (2023) [RU]

В материалах курса собраны наиболее широко используемые команды, позволяющие быстро начать работать в ОС Linux. Скучные и длинные лекции - не наш формат. Если Вы цените свое время, то здесь Вы найдете выжимку знаний, которые Вам действительно понадобятся для освоения этой операционной системы.
Курс основан на Linux Ubuntu, но любой другой популярный дистрибутив, который есть у Вас под рукой, также подойдет.
Вы узнаете про трюки и лайфхаки, которые помогут быстрее выполнять типовые операции. Познакомитесь со всеми необходимыми командами для работы с файлами и папками. Освоите работу с просмотрщиками файлов и самыми популярными текстовыми редакторами. И научитесь эффективно использовать поиск.', 'https://t.me/infSecIT/4/113') ON CONFLICT DO NOTHING;
INSERT INTO public."LinuxWindowsAD" VALUES (3, 'commands linux', 'Команды создания резервных копий (backup)

dump -0aj -f /tmp/home0.bak /home
создать полную резервную копию директории /home в файл /tmp/home0.bak

dump -1aj -f /tmp/home0.bak /home
создать инкрементальную резервную копию директории /home в файл /tmp/home0.bak

restore -if /tmp/home0.bak
восстановить из резервной копии /tmp/home0.bak

rsync -rogpav --delete /home /tmp
синхронизировать /tmp с /home

rsync -rogpav -e ssh --delete /home ip_address:/tmp
синхронизировать через SSH-туннель

rsync -az -e ssh --delete ip_addr:/home/public /home/local
синхронизировать локальную директорию с удалённой директорией через ssh-туннель со сжатием

rsync -az -e ssh --delete /home/local ip_addr:/home/public     
синхронизировать удалённую директорию с локальной директорией через ssh-туннель со сжатием

dd bs=1M if=/dev/hda | gzip | ssh user@ip_addr ‘dd of=hda.gz’
сделать «слепок» локального диска в файл на удалённом компьютере через ssh-туннель

tar -Puf backup.tar /home/user
создать инкрементальную резервную копию директории ‘/home/user’ в файл backup.tar с сохранением полномочий

( cd /tmp/local/ && tar c . ) | ssh -C user@ip_addr ‘cd /home/share/ && tar x -p’     
копирование содержимого /tmp/local на удалённый компьютер через ssh-туннель в /home/share/

( tar c /home ) | ssh -C user@ip_addr ‘cd /home/backup-home && tar x -p’
копирование содержимого /home на удалённый компьютер через ssh-туннель в /home/backup-home

tar cf — . | (cd /tmp/backup ; tar xf — )
копирование одной директории в другую с сохранением полномочий и линков

find /home/user1 -name ‘*.txt’ | \
xargs cp -av --target-directory=/home/backup/ --parents
поиск в /home/user1 всех файлов, имена которых оканчиваются на ‘.txt’, и копирование их в другую директорию

find /var/log -name ‘*.log’ | tar cv --files-from=- | bzip2 > log.tar.bz2
поиск в /var/log всех файлов, имена которых оканчиваются на ‘.log’, и создание bzip-архива из них', 'https://t.me/infSecIT/4/111') ON CONFLICT DO NOTHING;
INSERT INTO public."LinuxWindowsAD" VALUES (2, 'tools linux', 'Для мониторинга использования ресурсов в *nix вы скорее всего используете одну из встроенных утилит (top или htop), но мало кто знает о btop.

🛠 btop — инструмент для мониторинга ресурсов системы, который выводит статистку использования процессора, памяти, сети и дисков. Это альтернатива привычного вам инструмента с более приятным UI, поддержкой мыши, простой сортировкой/фильтрацией, кастомными настройками, возможностью отображения индикатора батареи и т. д.', 'https://t.me/infSecIT/4/110') ON CONFLICT DO NOTHING;
INSERT INTO public."LinuxWindowsAD" VALUES (1, 'commands linux', 'basic linux commands', 'https://t.me/infSecIT/4/109') ON CONFLICT DO NOTHING;


--
-- TOC entry 4937 (class 0 OID 16395)
-- Dependencies: 218
-- Data for Name: Network; Type: TABLE DATA; Schema: public; Owner: postgres
--

INSERT INTO public."Network" VALUES (10, 'source', 'Wireshark profiles.

•  Специально для любителей #Wireshark: репозиторий с кучей готовых профилей для анализа того или иного трафика.

•  Использовать чрезвычайно просто — качаете zip нужного профиля по ссылке ниже, импортируете в Wireshark, выбираете сетевой интерфейс... profit. Да, вы можете самостоятельно накидать для себя нужные фильтры, но тут уже все сделали за Вас. Пользуйтесь!', 'https://t.me/infSecIT/7/337') ON CONFLICT DO NOTHING;
INSERT INTO public."Network" VALUES (9, 'tools', 'Инструмент, разработанный на Python, для отображения содержимого сканирования Nmap в формате XML на сетевой диаграмме. Узлы представляют каждый из активов, сканируемых в сети, с соответствующими открытыми портами. Фильтрация портов позволяет отображать на графике только те устройства, у которых этот порт включен.', 'https://t.me/infSecIT/7/336') ON CONFLICT DO NOTHING;
INSERT INTO public."Network" VALUES (8, 'source', 'Протоколы и сети: основы

Фронтенд-разработчики работают с данными, которые путешествуют по сетям и передаются разными протоколами.
Протоколы и сети задействованы в типовых задачах, относящихся к передаче данных, оптимизации скорости загрузки и безопасности.

Знакомство с протоколами — необходимый навык для мидл-фронтенд-разработчиков. Важно понимать, как всё это устроено, чтобы лучше решать типовые задачи.

Язык: русский
Год выпуска: 2022', 'https://t.me/infSecIT/7/288') ON CONFLICT DO NOTHING;
INSERT INTO public."Network" VALUES (7, 'tools', 'Репозиторий: NetAlertX — революция в управлении сетью и безопасности

NetAlertX — это инструмент обнаружения злоумышленников Wi-Fi/LAN с открытым исходным кодом, который сканирует вашу сеть на наличие подключенных устройств и предупреждает вас при обнаружении новых или неизвестных устройств. 

— Данный инструмент обеспечивает видимость вашей сетевой активности, чтобы помочь вам отслеживать несанкционированный доступ.', 'https://t.me/infSecIT/7/278') ON CONFLICT DO NOTHING;
INSERT INTO public."Network" VALUES (6, 'commands', 'Полезные команды Linux. Сети (LAN / WiFi)

# dhclient eth0
Включить DHCP на сетевом интерфейсе eth0
# ethtool eth0
Вывести статистику по сетевому интерфейсу eth0
# hostname
Вывести имя компьютера
# host www.example.com
Преобразовать домен www.example.org в ip-адрес и наоборот
# ifconfig eth0
Вывести настройки сетевой карты eth0
# ifconfig eth0 promisc
Переключить интерфейс eth0 в promiscuous-режим для сбора сетевых пакетов
# ifup eth0
Включить сетевой интерфейс eth0
# ifdown eth0
Отключить сетевой интерфейс eth0
# ifconfig eth0 192.168.1.1 netmask 255.255.255.0
Назначить IP адрес и маску сетевому интерфейсу eth0
# ip link show
Вывести статус связи всех сетевых интерфейсов
# iwconfig eth1
Вывести конфигурацию беспроводного сетевого интерфейса eth1
# iwlist scan
Сканирование и поиск беспроводных сетей и точек доступа
# mii-tool eth0
Вывести состояние связи сетевого интерфейса eth0
# route add -net 192.168.0.0 netmask 255.255.0.0 gw 192.168.1.1
Добавить статический маршрут в сеть 192.168.0.0 через шлюз с ip-адресом 192.168.1.1
# route add -net 0/0 gw IP_Gateway
Назначить ip-адрес шлюза по умолчанию
# route del 0/0 gw IP_gateway
Удалить ip-адрес шлюза по умолчанию
# netstat -rn
Вывести таблицу маршрутизации', 'https://t.me/infSecIT/7/277') ON CONFLICT DO NOTHING;
INSERT INTO public."Network" VALUES (5, 'source', 'Компьютерные сети.

•  Основные сетевые термины и сетевые модели; 
•  Протоколы верхнего уровня; 
•  Протоколы нижних уровней (транспортного, сетевого и канального); 
•  Сетевые устройства и виды применяемых кабелей; 
•  Понятие IP адресации, масок подсетей и их расчет; 
•  Понятие VLAN, Trunk и протоколы VTP и DTP; 
•  Протокол связующего дерева: STP; 
•  Протокол агрегирования каналов: Etherchannel; 
•  Маршрутизация: статическая и динамическая на примере RIP, OSPF и EIGRP. ', 'https://t.me/infSecIT/7/276') ON CONFLICT DO NOTHING;
INSERT INTO public."Network" VALUES (4, 'cheatsheet', 'Шпаргалка по номерам портов', 'https://t.me/infSecIT/7/118') ON CONFLICT DO NOTHING;
INSERT INTO public."Network" VALUES (3, 'cheatsheet', 'Модель OSI, cheatsheet.', 'https://t.me/infSecIT/7/97') ON CONFLICT DO NOTHING;
INSERT INTO public."Network" VALUES (2, 'cheatsheet', 'nmap', 'https://t.me/infSecIT/7/96') ON CONFLICT DO NOTHING;
INSERT INTO public."Network" VALUES (1, 'source', 'Работа с Wireshark (2023)

🎓 Что в курсе?

В этом курсе вы рассмотрите следующие темы:
⏺️Display фильтры
⏺️Макросы для Display фильтров
⏺️Capture фильтры
⏺️Expert
⏺️Статистика
⏺️Анализ TCP
⏺️Работа с HTTP
⏺️Работа с HTTPs
⏺️Работа с зараженным хостом', 'https://t.me/infSecIT/7/95') ON CONFLICT DO NOTHING;


--
-- TOC entry 4944 (class 0 OID 16444)
-- Dependencies: 225
-- Data for Name: OSINTphishing; Type: TABLE DATA; Schema: public; Owner: postgres
--

INSERT INTO public."OSINTphishing" VALUES (11, 'tools', 'ShadowFinder.

•  A lightweight tool and Google Colab notebook for estimating the points on the Earth''s surface where a shadow of a particular length could occur, for geolocation purposes.

•  Using an object''s height, the lenth of its shadow, the date and the time, ShadowFinder estimates the possible locations where that shadow could occur.', 'https://t.me/infSecIT/30/344') ON CONFLICT DO NOTHING;
INSERT INTO public."OSINTphishing" VALUES (10, 'source', 'Обнаружение местоположения по тени на снимкеhow (https://t.me/c/1906856983/176/5794) to find a location using only the shadow', 'https://t.me/infSecIT/30/343') ON CONFLICT DO NOTHING;
INSERT INTO public."OSINTphishing" VALUES (9, 'tools source', 'Пробиваем человека в социальных сетях

Sherlock - это инструмент OSINT, который помогает тестировщикам на проникновение быстро определить, есть ли у их объекта какие-либо аккаунты в социальных сетях и платформы, на которых они могут существовать. 

Sherlock автоматизирует процесс проверки каждого сайта и формирует отчет о результатах.

В настоящее время инструмент способен находить пользователей в более чем 300 социальных сетях', 'https://t.me/infSecIT/30/265') ON CONFLICT DO NOTHING;
INSERT INTO public."OSINTphishing" VALUES (8, 'tools', 'Исследование чатов телеграмм 

Telepathy-Community – это OSINT-инструментарий для исследования чатов Telegram.
 
Telepathy называют "швейцарским армейским ножом инструментов Telegram", позволяющим аналитикам, исследователям и специалистам по цифровым расследованиям вести архив чатов Telegram.', 'https://t.me/infSecIT/30/108') ON CONFLICT DO NOTHING;
INSERT INTO public."OSINTphishing" VALUES (7, 'tools', 'Репозиторий: Pwndb — инструмент для поиска email-адресов

Pwndb — это инструмент, который предназначен для поиска утечек данных и скомпрометированных аккаунтов в интернете. Он обеспечивает возможность быстрого поиска информации о пользователях, которые могли попасть в базы данных.

— Данный инструмент консольный, и предназначен для поиска по различным категориям данных, таким как электронные адреса, пароли, имена пользователей и другие личные данные.', 'https://t.me/infSecIT/30/107') ON CONFLICT DO NOTHING;
INSERT INTO public."OSINTphishing" VALUES (6, 'source', 'Зеркало Интернета: Используем поисковые системы профессионально - Поиск приватной информации. 
 
О каком навыке идёт речь? Мы используем поисковые системы каждый день для поиска той или иной информации. 

⏺️В этом курсе мы будем учиться это делать профессионально и делать это по шагам с практическими примерами. 
⏺️Вы научитесь используя поисковые системы профессионально - искать быстрее, получать более полную и более точную информацию. 
⏺️Вы научитесь искать приватную информацию. ⏺️Курс рекомендуется широкому кругу пользователей и будет полезен не только специалистам OSINT. 
 
📚 Русский 
🕔 7часов', 'https://t.me/infSecIT/30/75') ON CONFLICT DO NOTHING;
INSERT INTO public."OSINTphishing" VALUES (5, 'tools', 'Утилиты для поиска по номерам телефонов

1. Moriarty (https://github.com/AzizKpln/Moriarty-Project) – утилита для реверсивного (обратного) поиска по телефонным номерам. 
Позволяет найти владельца, получить ссылки, страницы социальных сетей и другую связанную с номером информацию. 
2. Phomber (https://github.com/s41r4j/phomber) – выполняет поиск по телефонным номерам в интернете и извлекает все доступные данные.
3. PhoneInfoga (https://github.com/sundowndev/PhoneInfoga) – известный инструмент для поиска международных телефонных номеров. 
Сначала выдает стандартную информацию, такую как страна, регион, оператор связи по любому международному телефонному номеру, а затем ищет его следы в поисковых системах, чтобы помочь идентифицировать владельца.
4. kovinevmv/getcontact (https://github.com/kovinevmv/getcontact) – утилита для получения информации из баз приложения GetContact (не подходит для парсинга, позволяет выполнить только ограниченное число запросов).', 'https://t.me/infSecIT/30/74') ON CONFLICT DO NOTHING;
INSERT INTO public."OSINTphishing" VALUES (4, 'tools', 'MetaOSINT — Большая подборка Osint инструментов на любой случай жизни в формате бабл-визуализации. Автор собрал действительно просто громадную подборку инструментов и ресурсов', 'https://t.me/infSecIT/30/73') ON CONFLICT DO NOTHING;
INSERT INTO public."OSINTphishing" VALUES (3, 'tools', 'Инструменты поиска людей по фото

1. Social Catfish (https://social-catfish.pxf.io/c/1359419/1472958/12693?subId1=face-recognition-search-engines) это идеальная поисковая система по распознаванию лиц, которая может искать людей по лицу, имени, электронной почте.mail, адресу и имени пользователя. 

2. Spokeo (https://www.spokeo.com/?g=name_face9recognition9search9engines_A3313266936) это база данных, которая используются для идентификации людей и точного предоставления о них соответствующей информации. Она постоянно обновляется и насчитывает более 6 млн. потребителей, 130 млн. объектов недвижимости, 600 млн. юридических записей и более 120 социальных сетей, что делает его идеальной системой поиска людей для личного и делового использования.

3. Google Image Search (https://images.google.ru/) использует мощный робот Google Bot для сканирования всех общедоступных веб-сайтов на наличие изображений, чтобы создать самую большую и наиболее часто обновляемую базу данных изображений в мире.

4. PimEyes (https://pimeyes.com/) – это один из лучших инструментов поисковой системы по распознаванию лиц, который позволяет вам выполнять углубленный поиск изображений в Интернете. Усовершенствованные запутанные нейронные сети изучают загруженное вами изображение, чтобы найти объекты и сопоставить его с базой данных.

5. FaceCheck.ID — один из лучших инструментов обратного поиска изображений для распознавания лиц. Вы можете использовать его для поиска изображений конкретного человека. Он идентифицирует лица на загруженной вами фотографии, а затем находит похожие лица в сообщениях в социальных сетях, онлайн-видео, мошеннических аккаунтах, на веб-сайтах, на страницах новостей и блогов, а также в маркетинге продуктов.

', 'https://t.me/infSecIT/30/72') ON CONFLICT DO NOTHING;
INSERT INTO public."OSINTphishing" VALUES (2, 'tools source', 'Подборка полезных инструментов для фишинга.

Zphisher (https://github.com/htr-tech/zphisher) - удобный для новичков автоматизированный инструмент который  демонстрирует, (https://t.me/haccking) «как работает фишинг»

▫️Более чем 30 шаблонов. (https://t.me/haccking)
▫️Последние и обновленные страницы входа.
▫️Несколько вариантов туннелирования (Localhost, Cloudflared, LocalXpose).
▫️Поддержка URL-адреса маски.
▫️Поддержка Docker. (https://t.me/haccking)', 'https://t.me/infSecIT/30/71') ON CONFLICT DO NOTHING;
INSERT INTO public."OSINTphishing" VALUES (1, 'books', 'Анализ личности через профиль соцсетей. Интернет-разведка. 2023
Антон Рыбаков и Вадим Челпанов

Книга раскрывает различные методы, инструменты для поиска и дальнейшего использования полученных данных в профайлинге для оценки людей в обыденной жизни и деловых отношениях, проверки контрагентов, поиска подозреваемых лиц.
На реальных примерах эксперты Международной академии исследования лжи Вадим Челпанов и Антон Рыбаков рассказывают об этапах диагностического поиска, демонстрируя практическое применение методов разведки на основе открытых источников (англ. Open source intelligence, OSINT). Книга также содержит ресурсы, ссылки и рекомендации для дальнейшего изучения и обучения.', 'https://t.me/infSecIT/30/69') ON CONFLICT DO NOTHING;


--
-- TOC entry 4938 (class 0 OID 16402)
-- Dependencies: 219
-- Data for Name: PentestSoftware; Type: TABLE DATA; Schema: public; Owner: postgres
--

INSERT INTO public."PentestSoftware" VALUES (25, 'cheatsheet', 'RedTeaming_CheatSheet', 'https://t.me/infSecIT/6/335') ON CONFLICT DO NOTHING;
INSERT INTO public."PentestSoftware" VALUES (24, 'tools', 'CVEScannerV2 (https://github.com/scmanjarrez/CVEScannerV2) — скрипт Nmap, который сканирует вероятные уязвимости на основе сервисов, обнаруженных в открытых портах.', 'https://t.me/infSecIT/6/334') ON CONFLICT DO NOTHING;
INSERT INTO public."PentestSoftware" VALUES (23, 'cheatsheet', 'Reverse Shell Cheat Sheet', 'https://t.me/infSecIT/6/332') ON CONFLICT DO NOTHING;
INSERT INTO public."PentestSoftware" VALUES (22, 'tools', 'h2t

Простой инструмент, помогающий администраторам повысить безопасность своих веб-сайтов.
Скрипт проверяет заголовки сайта и выдает рекомендации, что можно поправить и улучшить.

', 'https://t.me/infSecIT/6/304') ON CONFLICT DO NOTHING;
INSERT INTO public."PentestSoftware" VALUES (21, 'tools', 'Получаем максимум информации из браузера.

•  Пароли, история браузера и загрузок, куки, список расширений и реквизиты банковской карты. Всё это Вы можете экспортировать через инструмент HackBrowserData, (https://github.com/moonD4rk/HackBrowserData) который имеет открытый исходный код и кроссплатформенность. Инструмент поможет Вам выгрузить все перечисленные данные из 18 браузеров в Linux, MacOS и Windows.

•  Все доступные параметры и команды можно посмотреть стандартным способом:', 'https://t.me/infSecIT/6/303') ON CONFLICT DO NOTHING;
INSERT INTO public."PentestSoftware" VALUES (20, 'tools source', 'Burpsuite v2024.1.1 + BurpBountyPro v2.7.0

Burp Suite — это интегрированная платформа, предназначенная для проведения аудита веб-приложения, как в ручном, так и в автоматических режимах.
Многофункциональный инструмент для проведения аудита безопасности веб-приложений.
Некоторые возможности:
Proxy — перехватывающий прокси-сервер, работающий в режиме man-in-the-middle. Есть Intercept mode (режим перехватчика)
Scanner — автоматический сканер уязвимостей ( OWASP TOP 10 и т.д.) 
Intruder — утилита, позволяющая в автоматическом режиме производить атаки различного вида, такие как брутфорс пароля, перебор идентификаторов, фаззинг и др.
Repeater — утилита для модифицирования и повторной отправки отдельных HTTP-запросов и анализа ответов приложения.

В комплекте 💻 Java 18 для 💻 Windows', 'https://t.me/infSecIT/6/301') ON CONFLICT DO NOTHING;
INSERT INTO public."PentestSoftware" VALUES (19, 'tools', 'Консольная утилита для генерации реверс-шеллов.', 'https://t.me/infSecIT/6/300') ON CONFLICT DO NOTHING;
INSERT INTO public."PentestSoftware" VALUES (18, 'tools', 'SSH-Snake — это bash-скрипт для автоматического обхода сети с использованием ssh-ключей, обнаруженных на скомпрометированных системах, и создания полной карты всех взломанных хостов.

Принцип работы:
1. Найти на текущей машине все приватные ssh-ключи
2. Просканировать сеть и найти живые хосты, к которым можно подключиться
3. Попытаться подключиться к хостам с ключами, найденными в первом пункте
4. После подключения к новому устройству, повторить все шаги, начиная с первого.

Возможности:
— переходит от одной системы к другой только с помощью bash и stdin, не создавая никаких файлов
— как только попал на новую систему, автоматически пытается повыситься до рута, используя sudo
— ищет закрытые ключи в часто используемых файлах и папках, обход гибко настраивается
— запоминает, какие машины уже были просканированы, чтобы не подключаться к ним снова
— генерирует на выходе готовый граф (вдохновлен bloodhound) и сохраняет все приватные ключи', 'https://t.me/infSecIT/6/299') ON CONFLICT DO NOTHING;
INSERT INTO public."PentestSoftware" VALUES (17, 'tools', 'acunetix v23.11.231123131

Acunetix — сканер веб-уязвимостей, автоматизирующий процесс проверки безопасности веб-приложений. Тестирует приложение на наличие SQL-инъекций, XSS, XXE, SSRF и многих других веб-уязвимостей. В народе известен как "окунь". Внутри README.txt файл с инструкцией.', 'https://t.me/infSecIT/6/296') ON CONFLICT DO NOTHING;
INSERT INTO public."PentestSoftware" VALUES (16, 'tools', 'Bashfuscator (https://github.com/Bashfuscator/Bashfuscator) – модульный, расширяемый фреймворк для обфускации bash.

Делает ваши однострочники сложными для понимания, упрощает создание запутанных команд.', 'https://t.me/infSecIT/6/295') ON CONFLICT DO NOTHING;
INSERT INTO public."PentestSoftware" VALUES (15, 'tools', 'RustHound — инструмент сбора данных Active Directory для BloodHound, написанный на Rust. 

В чем преимущества по сравнению с инструментом сбора данных SharpHound:

- Кроссплатформенность
- Меньше вероятность обнаружения антивирусами
- Кросс-компиляция
- Генерация JSON-файлов для различных доменнных сущностей
- Модули и функции, которые расширяют базовый функционал
- Оптимизация размера бинарного файла
- Производительность: согласно представленной статистике, RustHound работает быстрее, чем SharpHound и BloodHound в тестах на контроллерах доменнов с большим количеством объектов LDAP', 'https://t.me/infSecIT/6/294') ON CONFLICT DO NOTHING;
INSERT INTO public."PentestSoftware" VALUES (14, 'tools', 'Инструмент для создания вредоносных Zip-файлов, не требующих разархивации

ZipExec (https://github.com/Tylous/ZipExec) - это инструмент для выполнения полезной нагрузки, хранящейся в защищенных паролем zip-файлах, без их извлечения.

Инструмент передает zip-файлы на диск, используя JScript и COM-объекты, для создания zip-файла на диске и последующего их выполнения. Защита zip-файла паролем позволяет обходить EDR и механизмы сканирования антивирусов.', 'https://t.me/infSecIT/6/293') ON CONFLICT DO NOTHING;
INSERT INTO public."PentestSoftware" VALUES (13, 'books', 'Метасплоит для начинающих', 'https://t.me/infSecIT/6/274') ON CONFLICT DO NOTHING;
INSERT INTO public."PentestSoftware" VALUES (12, 'tools', 'WPProbe — быстрый и эффективный сканер WordPress-плагинов, который использует REST API enumeration для обнаружения установленных плагинов

В отличие от традиционных сканеров, которые «забивают» сайты запросами, WPProbe просто запрашивая открытый REST API (?rest_route). 

Эта техника позволяет скрытно идентифицировать плагины (~900), снижая риски обнаружения и ускоряя процесс сканирования. ', 'https://t.me/infSecIT/6/273') ON CONFLICT DO NOTHING;
INSERT INTO public."PentestSoftware" VALUES (11, 'source', 'Путь от ограниченного Path Traversal к RCE с вознаграждением в $40,000

История о нахождении и раскрутке RCE в публичной багбаунти программе.', 'https://t.me/infSecIT/6/263') ON CONFLICT DO NOTHING;
INSERT INTO public."PentestSoftware" VALUES (10, 'tools', 'Robofinder — это мощный скрипт Python, предназначенный для поиска и получения исторических файлов robots.txt из Archive.org для любого веб-сайта. Этот инструмент идеально подходит для исследователей безопасности, веб-архивистов и тестеров на проникновение, чтобы обнаружить ранее доступные пути или каталоги, которые были указаны в файле robots.txt сайта.', 'https://t.me/infSecIT/6/217') ON CONFLICT DO NOTHING;
INSERT INTO public."PentestSoftware" VALUES (9, 'tools source', 'Awesome browser exploit  — большой список полезных материалов по эксплойтам браузеров.', 'https://t.me/infSecIT/6/106') ON CONFLICT DO NOTHING;
INSERT INTO public."PentestSoftware" VALUES (8, 'tools', 'Acunetix v24.9.241015145 for Windows 

Стоимость: 2300$(слив)

Аcunetic- сканер приложений и сайтов на уязвимости.

-Находит любую информацию о сайте в том числе и прошлые домены;
-Отчет с уровнем серьезности уязвимости;
-Список уязвимостей можно фильтровать и сортировать, чтобы отдавать приоритет тем элементам, которые наиболее актуальны для ситуации.;
-Уязвимости межсайтового скриптинга;
-Уязвимости внедрения SQL;
-Слабые пароли.', 'https://t.me/infSecIT/6/105') ON CONFLICT DO NOTHING;
INSERT INTO public."PentestSoftware" VALUES (7, 'tools', 'Инструмент для поиска SQLi, CRLF, XSS, LFi, OpenRedirect уязвимостей.', 'https://t.me/infSecIT/6/104') ON CONFLICT DO NOTHING;
INSERT INTO public."PentestSoftware" VALUES (6, 'source', 'полезные ресурсы', 'https://t.me/infSecIT/6/103') ON CONFLICT DO NOTHING;
INSERT INTO public."PentestSoftware" VALUES (5, 'source', 'OWASP ZAP: курс по взлому веб-сайтов и тестированию на проникновение, Сагар Рагхуван, Udemy, 2022 г.
Password: @redbluehit', 'https://t.me/infSecIT/6/102') ON CONFLICT DO NOTHING;
INSERT INTO public."PentestSoftware" VALUES (4, 'cheatsheet', 'security information roadmap', 'https://t.me/infSecIT/6/101') ON CONFLICT DO NOTHING;
INSERT INTO public."PentestSoftware" VALUES (3, 'tools', 'Как я ищу XSS уязвимости одной командой

Для этого нам потребуется предварительно установить несколько утилит на языке GO (ну и соответсвенно сам GO тоже должен быть установлен).

В роли краулера утилита - gospider, (https://github.com/jaeles-project/gospider) представляющая собой веб-краулер для быстрого сбора URL-адресов, связанных с сайтом.

Вторая - qsreplace. (https://github.com/tomnomnom/qsreplace) Она принимает на вход URL-адреса и заменяет все значения строки запроса на значение, указанное пользователем.

Третья - dalfox. (https://github.com/hahwul/dalfox) Это производительный и быстрый инструмент для анализа параметров запроса и выявления различных типов XSS и других базовых уязвимостей.

После установки необходимо заменить строку https://example.com на адрес тестируемого сайта и выполнить команду:

gospider -s https://example.com -c 10 -d 5 --blacklist ".(jpg|jpeg|gif|css|tif|tiff|png|ttf|woff|woff2|ico|pdf|svg|txt)" --other-source | grep -e "code-200" | awk ''{print $5}'' | grep "=" | qsreplace -a | dalfox pipe -o result.txt', 'https://t.me/infSecIT/6/100') ON CONFLICT DO NOTHING;
INSERT INTO public."PentestSoftware" VALUES (2, 'tools', 'GOST: швейцарский нож для туннелирования и обхода блокировок.

Сегодня я расскажу о замечательном инструменте под названием GOST (Go Simple Tunnel). 

Он действительно простой в использовании и настройке, но при этом невероятно мощный, поскольку поддерживает огромное количество протоколов и транспортов, из которых вы при желании сможете построить самые упоротые и бронебойные комбинации.

Благодаря всему этому GOST является отличным инструментом как для повседневного использования, так и для экспериментов - когда цензоры вдруг начали активно банить то, чем вы пользуетесь, можно быстро и просто экспериментировать с разными комбинациями протоколов чтобы найти те, что не заблокированы.

Два основных типа аргументов у GOST: -L и -F. -L (listen) - это когда процесс слушает входящие подключения на каком-то порту по какому-то протоколу. 

Аргументов -L может быть несколько, в таком случае он будет слушать их одновременно. 

А -F (forward) - это когда процесс будет перенаправлять полученные запросы на какой-то сервер по какому-то протоколу. 

Аргументов -F может быть тоже несколько - тогда у вас получится цепочка серверов (клиент подключится сначала к первому серверу, потом через него ко второму, и т.д.). 

Есть также варианты балансировки и автоматического выбора серверов из списка.', 'https://t.me/infSecIT/6/99') ON CONFLICT DO NOTHING;
INSERT INTO public."PentestSoftware" VALUES (1, 'tools', 'Awesome Bug Bounty Tools.

•  Большой список инструментов для Bug Bounty, который разбит по следующим категориям:

•  Recon:
 - Subdomain Enumeration; 
 - Port Scanning; 
 - Screenshots; 
 - Technologies; 
 - Content Discovery; 
 - Links; 
 - Parameters; 
 - Fuzzing. 

•  Exploitation:
 - Command Injection;
 - CORS Misconfiguration; 
 - CRLF Injection; 
 - CSRF Injection; 
 - Directory Traversal; 
 - File Inclusion; 
 - GraphQL Injection; 
 - Header Injection; 
 - Insecure Deserialization; 
 - Insecure Direct Object References; 
 - Open Redirect; (https://github.com/vavkamil/awesome-bugbounty-tools#Open-Redirect)
 - Race Condition; 
 - Request Smuggling;  - Server Side Request Forgery; 
 - SQL Injection; 
 - XSS Injection; 
 - XXE Injection. 
•  Miscellaneous:
 - Passwords; 
 - Secrets; 
 - Git; 
 - Buckets; 
 - CMS; 
 - JSON Web Token; 
 - postMessage
 - Subdomain Takeover; 
 - Uncategorized. ', 'https://t.me/infSecIT/6/98') ON CONFLICT DO NOTHING;


--
-- TOC entry 4936 (class 0 OID 16388)
-- Dependencies: 217
-- Data for Name: Programming; Type: TABLE DATA; Schema: public; Owner: postgres
--

INSERT INTO public."Programming" VALUES (1, 'js books', 'java script для разработчиков pdf файл', 'https://t.me/infSecIT/29/77') ON CONFLICT DO NOTHING;
INSERT INTO public."Programming" VALUES (2, 'js books', 'java script пособие', 'https://t.me/infSecIT/29/78') ON CONFLICT DO NOTHING;
INSERT INTO public."Programming" VALUES (3, 'js books', 'java script для начинающих', 'https://t.me/infSecIT/29/79') ON CONFLICT DO NOTHING;
INSERT INTO public."Programming" VALUES (4, 'python books', 'Программирование для «нормальных» с нуля на языке Python. Часть 1 и 2

Автор: М.В. Сысоева, И.В. Сысоев, 2023

Описание: Книга – учебник, задачник и самоучитель по алгоритмизации и программированию на
языке Python. Она не требует предварительных знаний в области программирования и
может использоваться для обучения «с нуля».
Издание адресовано студентам, аспирантам и преподавателям инженерных и естественно-научных специальностей вузов, школьникам старших классов и учителям информатики. Обучение языку в значительной степени строится на примерах решения задач обработки результатов радиофизического и биологического экспериментов.

', 'https://t.me/infSecIT/29/80') ON CONFLICT DO NOTHING;
INSERT INTO public."Programming" VALUES (5, 'c books', 'Практическое
введение в язык
программирования СИ. 2021
Солдатенко И. С.', 'https://t.me/infSecIT/29/83') ON CONFLICT DO NOTHING;
INSERT INTO public."Programming" VALUES (6, 'js books', 'javascript для хакеров', 'https://t.me/infSecIT/29/84') ON CONFLICT DO NOTHING;
INSERT INTO public."Programming" VALUES (7, 'python books', 'Книга: Black Hat Python: программирование для хакеров и пентестеров, 2-е изд

Во втором издании бестселлера Black Hat Python вы исследуете темную сторону возможностей Python — все от написания сетевых снифферов, похищения учетных данных электронной почты до разработки анализа виртуальных машин и создания скрытых троянов.', 'https://t.me/infSecIT/29/85') ON CONFLICT DO NOTHING;
INSERT INTO public."Programming" VALUES (8, 'html css books js', 'HTML, CSS, & JavaScript All-in-One For Dummies (2023)
Автор: Paul McFedries
Количество страниц: 848

Вы научитесь создавать привлекательные, полезные и удобные в навигации сайты, сочетая HTML, CSS и JavaScript в увлекательных и практичных проектах. Используя 6 книг, собранных в этом полном сборнике, вы узнаете, как создавать статические и динамические веб-сайты с интуитивно понятными макетами и классной анимацией.', 'https://t.me/infSecIT/29/86') ON CONFLICT DO NOTHING;
INSERT INTO public."Programming" VALUES (9, 'assembler books', 'Книга "Программирование на языке ассемблера IBM PC"', 'https://t.me/infSecIT/29/255') ON CONFLICT DO NOTHING;
INSERT INTO public."Programming" VALUES (10, 'php mysql html css js books', 'Книга: "Создаем динамические веб-сайты с помощью PHP, MySQL, JavaScript, CSS и HTML5. 6-е изд."

Автор: Никсон Робин
Год выхода: 2023

Описание: Новое издание бестселлера описывает как клиентские, так и серверные аспекты веб-разработки. Книга, наполненная ценными практическими советами и подробным теоретическим материалом, поможет вам освоить динамическое веб-программирование с применением самых современных технологий. Для закрепления усвоенных знаний автор расскажет, как создать полнофункциональный сайт, работающий по принципу социальной сети.', 'https://t.me/infSecIT/29/258') ON CONFLICT DO NOTHING;
INSERT INTO public."Programming" VALUES (11, 'python cheatsheets', 'Инфографика полезных Python библиотек', 'https://t.me/infSecIT/29/260') ON CONFLICT DO NOTHING;
INSERT INTO public."Programming" VALUES (12, 'api source', 'Laravel — создание крутого API

Описание:
В этом курсе мы полностью разберемся с понятием REST API и научимся писать свои собственный запросы используя лучшие практики на Laravel.

⏱️ Продолжительность: 11 часов 14 минут', 'https://t.me/infSecIT/29/261') ON CONFLICT DO NOTHING;
INSERT INTO public."Programming" VALUES (13, 'wordpress #ooks', 'wordpress', 'https://t.me/infSecIT/29/272') ON CONFLICT DO NOTHING;
INSERT INTO public."Programming" VALUES (14, 'books cpplus', 'Programming: Principles and Practice Using C++ (2023)
✍️Автор: Bjarne Stroustrup
📃Страниц: 656

Эта книга:

- Фокусируется на фундаментальных концепциях и методах, а не на непонятных технических деталях языка
- Является введением в программирование в целом, включая процедурное, объектно-ориентированное и общее программирование, а не просто введением в язык программирования
- Охватывает как современные методы высокого уровня, так и методы нижнего уровня, необходимые для эффективного использования аппаратных средств
- Даст вам прочный фундамент для написания полезного, корректного, безопасного с точки зрения типов, сопровождаемого и эффективного кода
- Используется современный язык C++ (C++20 и C++23)', 'https://t.me/infSecIT/29/339') ON CONFLICT DO NOTHING;
INSERT INTO public."Programming" VALUES (15, 'c source', 'Специалист, Кораблин Александр | Программирование на языке C (2020) 

Описание:

В курсе обращается особое внимание на получение теоретических знаний, как по самому языку Си, так и по методам разработки алгоритмов, выбора и проектирования структур данных, создания и тестирования программного обеспечения.

В свое время язык С (Си) стал первым языком, который применяется в разработке системного программного обеспечения. В наше время он остаётся языком, реализованным на максимальном количестве аппаратных платформ, и одним из самых популярных языков программирования, особенно в мире свободного программного обеспечения. Кроме этого, язык С (Си) является основой для таких языков программирования, как C++, C#, Java и Objective-C. Курс охватывает два стандарта языка С, а именно С89 и С11 появившийся в 2011 году.', 'https://t.me/infSecIT/29/341') ON CONFLICT DO NOTHING;


--
-- TOC entry 4941 (class 0 OID 16423)
-- Dependencies: 222
-- Data for Name: ReversMalwaredev; Type: TABLE DATA; Schema: public; Owner: postgres
--

INSERT INTO public."ReversMalwaredev" VALUES (5, 'revers books', 'Книга "Practical reverse engineering: x86, x64, ARM, Windows Kernel, reversing tools, and obfuscation"

', 'https://t.me/infSecIT/34/246') ON CONFLICT DO NOTHING;
INSERT INTO public."ReversMalwaredev" VALUES (4, 'books malware', 'Книга "Rootkits and Bootkits: Reversing Modern Malware and Next Generation Threats', 'https://t.me/infSecIT/34/245') ON CONFLICT DO NOTHING;
INSERT INTO public."ReversMalwaredev" VALUES (3, 'books malware', 'Malware Development for Ethical Hackers: (https://t.me/progbook_extra/2098) Learn how to develop various types of malware to strengthen cybersecurity (2024)
✍️ Автор: Zhassulan Znussupov
📃 Страниц: 390

Книга отправит вас в путешествие по запутанному миру разработки вредоносных программ, проливая свет на методы и стратегии, используемые киберпреступниками. По мере продвижения вы сосредоточитесь на этических соображениях, которых должны придерживаться этичные хакеры. Вы также получите практический опыт в создании и реализации популярных техник, встречающихся в реальных вредоносных приложениях, таких как Carbanak, Carberp, Stuxnet, Conti, Babuk и BlackCat ransomware. Эта книга также вооружит вас знаниями и навыками, необходимыми для понимания и эффективной борьбы с вредоносным ПО.
', 'https://t.me/infSecIT/34/54') ON CONFLICT DO NOTHING;
INSERT INTO public."ReversMalwaredev" VALUES (2, 'books malware', 'PRO ВИРУСЫ. Издание четвертое, переработанное и дополненное, верися 4.0, Валентин Холмогоров, 2020

Книга рассказывает об истории возникновения и развития технологий компьютерных вирусов, их разновидностях, внутренней архитектуре, способах распространения и принципах действия. Книга позволит читателям познакомиться с таинственным теневым миром киберпреступности, представители которого ежедневно осуществляют атаки на компьютеры простых пользователей по всему миру', 'https://t.me/infSecIT/34/52') ON CONFLICT DO NOTHING;
INSERT INTO public."ReversMalwaredev" VALUES (1, 'books malware', 'Книга: "Записки исследователя компьютерных вирусов"

Автор: Крис Касперски
Год выхода: 2019

Описание: Данная книга представляет собой робкую попытку хотя бы частично заткнуть информационную брешь, раскрывая повадки вирусов и предлагая эффективные средства защиты и борьбы. Материал ориентирован на системных администраторов и программистов с минимальным уровнем подготовки.', 'https://t.me/infSecIT/34/51') ON CONFLICT DO NOTHING;


--
-- TOC entry 4943 (class 0 OID 16437)
-- Dependencies: 224
-- Data for Name: ServerDocker; Type: TABLE DATA; Schema: public; Owner: postgres
--

INSERT INTO public."ServerDocker" VALUES (8, 'docker books', 'Книга: "Docker Compose для разработчика: Упростите разработку и оркестрацию многоконтейнерных приложений"

Автор: Эммануил Гадзурас
Год выхода: 2023

Описание: Разработка программного обеспечения становится все сложнее из-за использования различных инструментов. Приложения приходится упаковывать вместе с программными компонентами, чтобы упростить их работу, но это усложняет их запуск. С помощью Docker Compose можно всего одной командой настроить приложение и необходимые зависимости.', 'https://t.me/infSecIT/32/355') ON CONFLICT DO NOTHING;
INSERT INTO public."ServerDocker" VALUES (7, 'docker cheatsheet', 'Шпаргалка по командам Docker.', 'https://t.me/infSecIT/32/345') ON CONFLICT DO NOTHING;
INSERT INTO public."ServerDocker" VALUES (6, 'docker cheatsheet', 'Шпаргалка по Docker', 'https://t.me/infSecIT/32/254') ON CONFLICT DO NOTHING;
INSERT INTO public."ServerDocker" VALUES (5, 'docker source', 'Советуем к просмотру видеоролик на ютубе по Docker. Он на 3 часа, но зато весь материал понятен и пойдет новичкам. В свое время нам он дал хорошую базу и общее понимание, отличный старт для изучения контейнеризации 🌐', 'https://t.me/infSecIT/32/253') ON CONFLICT DO NOTHING;
INSERT INTO public."ServerDocker" VALUES (4, 'waf', 'web application firewall', 'https://t.me/infSecIT/32/67') ON CONFLICT DO NOTHING;
INSERT INTO public."ServerDocker" VALUES (3, 'docker', 'Docker и Docker Compose Деплой проекта с нуля', 'https://t.me/infSecIT/32/66') ON CONFLICT DO NOTHING;
INSERT INTO public."ServerDocker" VALUES (2, 'nginx servers source', 'Nginx — это веб-сервер, на котором работает треть всех сайтов в мире. Но если забыть или проигнорировать некоторые ошибки в настройках, можно стать отличной мишенью для атакующих. Благодаря этому (https://blog.devsecopsguides.com/nginx-path-configuration-pitfalls#heading-8-http-to-https-redirect) материалу, можно понять какие ошибки в конфигурациях встречаются чаще всего и как их исправить.', 'https://t.me/infSecIT/32/65') ON CONFLICT DO NOTHING;
INSERT INTO public."ServerDocker" VALUES (1, 'servers books', 'Сервер на Windows и Linux. Администрирование и виртуализация

Авторы: Левицкий Н.Д., Завьялов А.В.

В этой книге вы сможете найти полезную информацию по администрированию и использованию серверов на Windows и Linux, причем как физических (локальных), так и виртуальных. Вы узнаете об отличиях, недостатках и преимуществах физического и виртуального сервера - вполне возможно, что это поможет вам определиться с типом сервера для своих личных задач.', 'https://t.me/infSecIT/32/63') ON CONFLICT DO NOTHING;


--
-- TOC entry 4942 (class 0 OID 16430)
-- Dependencies: 223
-- Data for Name: SteganographyCryptography; Type: TABLE DATA; Schema: public; Owner: postgres
--

INSERT INTO public."SteganographyCryptography" VALUES (10, 'tools steganography', 'project ', 'https://t.me/infSecIT/33/360') ON CONFLICT DO NOTHING;
INSERT INTO public."SteganographyCryptography" VALUES (9, 'source crypto', 'Полнодисковое шифрование Windows и Linux
установленных систем. Зашифрованная
мультизагрузка', 'https://t.me/infSecIT/33/358') ON CONFLICT DO NOTHING;
INSERT INTO public."SteganographyCryptography" VALUES (8, 'crack source', 'Репозиторий включает в себя список фраз (более 20 миллионов) и два файла правил #hashcat для брута на GPU. Правила создадут более 1000 вариантов каждой фазы.

 https://github.com/initstring/passphrase-wordlist

•  Для генерации собственных словарей можно использовать программы Hashcat, John the Ripper, crunch, statsprocessor, maskprocessor и другие.', 'https://t.me/infSecIT/33/250') ON CONFLICT DO NOTHING;
INSERT INTO public."SteganographyCryptography" VALUES (7, 'crypto books', 'OpenSSL 3: ключ к тайнам криптографии', 'https://t.me/infSecIT/33/249') ON CONFLICT DO NOTHING;
INSERT INTO public."SteganographyCryptography" VALUES (6, 'steganography', 'SecretPixel (https://github.com/x011/SecretPixel) — это усовершенствованный инструмент стеганографии, который скрывает конфиденциальную информацию внутри изображений.  

Функции включают шифрование с использованием AES-256 и RSA, сжатие для минимизации шаблонов, стеганографию с заполнением LSB для разброса скрытых битов и хранение имен файлов в изображении. ', 'https://t.me/infSecIT/33/62') ON CONFLICT DO NOTHING;
INSERT INTO public."SteganographyCryptography" VALUES (5, 'steganography', 'Top Steganography Methods.

•  Шифрование помогает сохранять данные в секрете, но одновременно привлекает лишнее внимание. Если файл так просто не открыть, значит, в нем наверняка есть что-то ценное. Поэтому бывает важно скрыть само наличие секретной информации. Проще всего это сделать, растворив конфиденциальные данные внутри какого-нибудь безобидного файла.', 'https://t.me/infSecIT/33/61') ON CONFLICT DO NOTHING;
INSERT INTO public."SteganographyCryptography" VALUES (4, 'crack crypto source tools', 'Автоматически расшифровывайте шифры без знания ключа или шифра, декодируйте кодировки и взламывайте хеши. Если вы мало что знаете о криптографии или хотите быстро проверить зашифрованный текст, прежде чем работать с ним самостоятельно, Ciphey идеально подойдет вам.

Ciphey использует специально созданный модуль искусственного интеллекта (AuSearch) с интерфейсом обнаружения шифров, чтобы приблизительно определить, чем что-то зашифровано. А затем, настраиваемый интерфейс проверки языка, помогает собрать из приблизительного текста — истинный.', 'https://t.me/infSecIT/33/60') ON CONFLICT DO NOTHING;
INSERT INTO public."SteganographyCryptography" VALUES (3, 'steganography source', 'Шифруем и скрываем файлы внутри изображений с помощью Python

https://youtube.com/shorts/S2GyLXiw3AQ

⚙️ GitHub/Инструкция (https://github.com/priyansh-anand/steganographer)

$ git clone https://github.com/priyansh-anand/steganographer.git
$ cd steganographer
$ pip install -r requirements.txt
$ python steganographer.py - -menu', 'https://t.me/infSecIT/33/59') ON CONFLICT DO NOTHING;
INSERT INTO public."SteganographyCryptography" VALUES (2, 'crypto source', 'Cryptography for Hackers.

•  Encryption and Decryption in Cryptography; 
•  Popular Cryptographic Methods; 
•  Hashing in Cryptography; 
•  Difference Between Data-at-Rest and Data-in-Transit Cryptography; 
•  Finding the Cryptography Algorithm from Encrypted Text: 
 - Step-by-Step Process; 
 - Step-by-Step Character Review and Conditions; 
•  Scenario: Received Encrypted Text: 
 - Step-by-Step Example; 
•  Arithmetic and Logic Operations: 
 - Set Operations; 
 - Logic Operations; 
 - Arithmetic Operations; 
 - Bitwise Operations; 
 - ROT Cipher Operations; 
•  Compression and Decompression Techniques:  - Compression and Decompression Methods; 
•  Block and Stream Ciphers;  Hashing Algorithms and Checksum Methods; 
•  Technical Analysis of Cryptographic Operations; 
•  Data Format Conversion Algorithms. ', 'https://t.me/infSecIT/33/58') ON CONFLICT DO NOTHING;
INSERT INTO public."SteganographyCryptography" VALUES (1, 'crack books', 'Ethical Password Cracking: (https://t.me/progbook_extra/1332) Decode passwords using John the Ripper, hashcat, and advanced methods for password breaking (2024)
✍️Автор: James Leyte-Vidal
📃Страниц: 168

По мере продвижения по главам вы сначала познакомитесь с тем, как хранятся учетные данные, а затем кратко рассмотрите математические основы взлома паролей. Затем в книге рассматриваются различные инструменты и техники, которые помогут вам восстановить нужные пароли, после чего вы перейдете к рассмотрению распространенных случаев взлома, восстановлению хэшей и взлому. На реальных примерах вы рассмотрите подходы, основанные на переборе и словаре, и научитесь применять их для различных типов хранения учетных данных.', 'https://t.me/infSecIT/33/56') ON CONFLICT DO NOTHING;


--
-- TOC entry 4782 (class 2606 OID 16422)
-- Name: Databases Databases_pkey; Type: CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public."Databases"
    ADD CONSTRAINT "Databases_pkey" PRIMARY KEY (post_id);


--
-- TOC entry 4780 (class 2606 OID 16415)
-- Name: LinuxWindowsAD LinuxWindowsAD_pkey; Type: CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public."LinuxWindowsAD"
    ADD CONSTRAINT "LinuxWindowsAD_pkey" PRIMARY KEY (post_id);


--
-- TOC entry 4776 (class 2606 OID 16401)
-- Name: Network Network_pkey; Type: CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public."Network"
    ADD CONSTRAINT "Network_pkey" PRIMARY KEY (post_id);


--
-- TOC entry 4790 (class 2606 OID 16450)
-- Name: OSINTphishing OSINTphishing_pkey; Type: CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public."OSINTphishing"
    ADD CONSTRAINT "OSINTphishing_pkey" PRIMARY KEY (post_id);


--
-- TOC entry 4778 (class 2606 OID 16408)
-- Name: PentestSoftware PentestSoftware_pkey; Type: CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public."PentestSoftware"
    ADD CONSTRAINT "PentestSoftware_pkey" PRIMARY KEY (post_id);


--
-- TOC entry 4784 (class 2606 OID 16429)
-- Name: ReversMalwaredev ReversMalwaredev_pkey; Type: CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public."ReversMalwaredev"
    ADD CONSTRAINT "ReversMalwaredev_pkey" PRIMARY KEY (post_id);


--
-- TOC entry 4788 (class 2606 OID 16443)
-- Name: ServerDocker ServerDocker_pkey; Type: CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public."ServerDocker"
    ADD CONSTRAINT "ServerDocker_pkey" PRIMARY KEY (post_id);


--
-- TOC entry 4786 (class 2606 OID 16436)
-- Name: SteganographyCryptography SteganographyCryptography_pkey; Type: CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public."SteganographyCryptography"
    ADD CONSTRAINT "SteganographyCryptography_pkey" PRIMARY KEY (post_id);


--
-- TOC entry 4774 (class 2606 OID 16394)
-- Name: Programming programming_pkey; Type: CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public."Programming"
    ADD CONSTRAINT programming_pkey PRIMARY KEY (post_id);


-- Completed on 2025-03-12 21:59:53

--
-- PostgreSQL database dump complete
--

